actiontravel_transfersbd/test4/transferAvailByHotelRQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://www.juniper.es/webservice/2007/">
<soapenv:Header/>
<soapenv:Body>
    <TransferAvailByHotel>
        <TransferAvailRQByHotel Version="1.1" Language="es">
            <Login Password="xA2d@a1X" Email="paulo@corp.bug-software.com"/>
            <Paxes>
                <Pax IdPax="1">
                    <Age>30</Age>
                </Pax>
                <Pax IdPax="2">
                    <Age>30</Age>
                </Pax>
            </Paxes>
            <TransferRequestByHotel>
                <SearchSegmentsTransfers>
                    <SearchSegmenTransfers HotelCode="JP046300" Start="2020-08-17" End="2020-08-20" OriginZone="15011"/>
                </SearchSegmentsTransfers>
                <RelPaxesDist>
                    <RelPaxDist>
                        <RelPaxes>
                            <RelPax IdPax="1"/>
                            <RelPax IdPax="2"/>
                        </RelPaxes>
                    </RelPaxDist>
                </RelPaxesDist>
            </TransferRequestByHotel>
        </TransferAvailRQByHotel>
    </TransferAvailByHotel>
</soapenv:Body>
</soapenv:Envelope>